## Production: api
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 6 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                           NAME                                           |
|--------|------------------------------------------------------------------------------------------|
| add    | `module.rds.aws_security_group_rule.rds_egress`                                          |
|        | `module.rds.aws_security_group_rule.rds_ingress`                                         |
| update | `aws_lambda_alias.api_provisioned_latest`                                                |
|        | `module.rds.aws_cloudwatch_log_group.log_exports[&quot;postgresql&quot;]`                          |
|        | `module.scan_files[&quot;api&quot;].aws_cloudwatch_query_definition.lambda_statistics`             |
|        | `module.scan_files[&quot;api&quot;].aws_lambda_function.this`                                      |
|        | `module.scan_files[&quot;api-provisioned&quot;].aws_cloudwatch_query_definition.lambda_statistics` |
|        | `module.scan_files[&quot;api-provisioned&quot;].aws_lambda_function.this`                          |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_lambda_alias.api_provisioned_latest will be updated in-place
  ~ resource "aws_lambda_alias" "api_provisioned_latest" {
      ~ function_version = "3" -> (known after apply)
        id               = "arn:aws:lambda:ca-central-1:806545929748:function:scan-files-api-provisioned:latest"
        name             = "latest"
        # (4 unchanged attributes hidden)
    }

  # module.rds.aws_cloudwatch_log_group.log_exports["postgresql"] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "log_exports" {
        id                = "/aws/rds/cluster/scan-files-cluster/postgresql"
        name              = "/aws/rds/cluster/scan-files-cluster/postgresql"
      ~ retention_in_days = 30 -> 7
        tags              = {
            "CostCentre" = "scan-files-production"
            "Name"       = "scan-files-cluster"
            "Terraform"  = "true"
        }
        # (6 unchanged attributes hidden)
    }

  # module.rds.aws_cloudwatch_log_group.proxy has moved to module.rds.aws_cloudwatch_log_group.proxy[0]
    resource "aws_cloudwatch_log_group" "proxy" {
        id                = "/aws/rds/proxy/scan-files-proxy"
        name              = "/aws/rds/proxy/scan-files-proxy"
        tags              = {
            "CostCentre" = "scan-files-production"
            "Name"       = "scan-files_proxy_logs"
            "Terraform"  = "true"
        }
        # (7 unchanged attributes hidden)
    }

  # module.rds.aws_db_proxy.proxy has moved to module.rds.aws_db_proxy.proxy[0]
    resource "aws_db_proxy" "proxy" {
        id                     = "scan-files-proxy"
        name                   = "scan-files-proxy"
        tags                   = {
            "CostCentre" = "scan-files-production"
            "Name"       = "scan-files-rds-proxy"
            "Terraform"  = "true"
        }
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.rds.aws_db_proxy_default_target_group.this has moved to module.rds.aws_db_proxy_default_target_group.this[0]
    resource "aws_db_proxy_default_target_group" "this" {
        id            = "scan-files-proxy"
        name          = "default"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.rds.aws_db_proxy_target.target has moved to module.rds.aws_db_proxy_target.target[0]
    resource "aws_db_proxy_target" "target" {
        id                    = "scan-files-proxy/default/TRACKED_CLUSTER/scan-files-cluster"
        # (9 unchanged attributes hidden)
    }

  # module.rds.aws_iam_policy.read_connection_string has moved to module.rds.aws_iam_policy.read_connection_string[0]
    resource "aws_iam_policy" "read_connection_string" {
        id               = "arn:aws:iam::806545929748:policy/scan-filesReadConnectionString"
        name             = "scan-filesReadConnectionString"
        tags             = {
            "CostCentre" = "scan-files-production"
            "Terraform"  = "true"
        }
        # (8 unchanged attributes hidden)
    }

  # module.rds.aws_iam_role.rds_proxy has moved to module.rds.aws_iam_role.rds_proxy[0]
    resource "aws_iam_role" "rds_proxy" {
        id                    = "scan-files_rds_proxy"
        name                  = "scan-files_rds_proxy"
        tags                  = {
            "CostCentre" = "scan-files-production"
            "Terraform"  = "true"
        }
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.rds.aws_iam_role_policy_attachment.read_connection_string has moved to module.rds.aws_iam_role_policy_attachment.read_connection_string[0]
    resource "aws_iam_role_policy_attachment" "read_connection_string" {
        id         = "scan-files_rds_proxy-20211115165439547600000002"
        # (2 unchanged attributes hidden)
    }

  # module.rds.aws_secretsmanager_secret.connection_string has moved to module.rds.aws_secretsmanager_secret.connection_string[0]
    resource "aws_secretsmanager_secret" "connection_string" {
        id                             = "arn:aws:secretsmanager:ca-central-1:806545929748:secret:scan-files-p2omli-cpSHLz"
        name                           = "scan-files-p2omli"
        tags                           = {
            "CostCentre" = "scan-files-production"
            "Terraform"  = "true"
        }
        # (8 unchanged attributes hidden)
    }

  # module.rds.aws_secretsmanager_secret.proxy_connection_string has moved to module.rds.aws_secretsmanager_secret.proxy_connection_string[0]
    resource "aws_secretsmanager_secret" "proxy_connection_string" {
        id                             = "arn:aws:secretsmanager:ca-central-1:806545929748:secret:scan-files-p2omli-proxy-connection-string-grby2z"
        name                           = "scan-files-p2omli-proxy-connection-string"
        tags                           = {
            "CostCentre" = "scan-files-production"
            "Terraform"  = "true"
        }
        # (8 unchanged attributes hidden)
    }

  # module.rds.aws_secretsmanager_secret_version.connection_string has moved to module.rds.aws_secretsmanager_secret_version.connection_string[0]
    resource "aws_secretsmanager_secret_version" "connection_string" {
        id             = "arn:aws:secretsmanager:ca-central-1:806545929748:secret:scan-files-p2omli-cpSHLz|B82F8803-A472-43AE-AFC4-06378E0CEA19"
        # (6 unchanged attributes hidden)
    }

  # module.rds.aws_secretsmanager_secret_version.proxy_connection_string has moved to module.rds.aws_secretsmanager_secret_version.proxy_connection_string[0]
    resource "aws_secretsmanager_secret_version" "proxy_connection_string" {
        id             = "arn:aws:secretsmanager:ca-central-1:806545929748:secret:scan-files-p2omli-proxy-connection-string-grby2z|45C68FDF-478A-47E8-800B-C3962446FE0E"
        # (6 unchanged attributes hidden)
    }

  # module.rds.aws_security_group.rds_proxy has moved to module.rds.aws_security_group.rds
    resource "aws_security_group" "rds" {
        id                     = "sg-0df33dfc9ddb1acf5"
        name                   = "scan-files_rds_proxy_sg"
        tags                   = {
            "CostCentre" = "scan-files-production"
            "Name"       = "scan-files_rds_proxy_sg"
            "Terraform"  = "true"
        }
        # (9 unchanged attributes hidden)
    }

  # module.rds.aws_security_group_rule.rds_egress will be created
  + resource "aws_security_group_rule" "rds_egress" {
      + description              = "Egress from the database"
      + from_port                = 5432
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-0df33dfc9ddb1acf5"
      + security_group_rule_id   = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 5432
      + type                     = "egress"
    }

  # module.rds.aws_security_group_rule.rds_ingress will be created
  + resource "aws_security_group_rule" "rds_ingress" {
      + description              = "Ingress to the database"
      + from_port                = 5432
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-0df33dfc9ddb1acf5"
      + security_group_rule_id   = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 5432
      + type                     = "ingress"
    }

  # module.scan_files["api"].aws_cloudwatch_query_definition.lambda_statistics will be updated in-place
  ~ resource "aws_cloudwatch_query_definition" "lambda_statistics" {
        id                  = "72cc197f-58a4-4974-ad6b-92fc3be9a310"
      ~ name                = "Lambda Statistics - scan-files-api" -> "Lambda Statistics / scan-files-api"
        # (3 unchanged attributes hidden)
    }

  # module.scan_files["api"].aws_lambda_function.this will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "scan-files-api"
        tags                           = {
            "CostCentre" = "scan-files-production"
            "Terraform"  = "true"
        }
        # (28 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "AV_SCAN_USE_CACHE"            = "False"
                # (12 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.scan_files["api-provisioned"].aws_cloudwatch_query_definition.lambda_statistics will be updated in-place
  ~ resource "aws_cloudwatch_query_definition" "lambda_statistics" {
        id                  = "bf71c02d-eed5-4d16-98f2-49e6464980ec"
      ~ name                = "Lambda Statistics - scan-files-api-provisioned" -> "Lambda Statistics / scan-files-api-provisioned"
        # (3 unchanged attributes hidden)
    }

  # module.scan_files["api-provisioned"].aws_lambda_function.this will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "scan-files-api-provisioned"
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:806545929748:function:scan-files-api-provisioned:3" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:806545929748:function:scan-files-api-provisioned:3/invocations" -> (known after apply)
        tags                           = {
            "CostCentre" = "scan-files-production"
            "Terraform"  = "true"
        }
      ~ version                        = "3" -> (known after apply)
        # (25 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "AV_SCAN_USE_CACHE"            = "False"
                # (12 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 2 to add, 6 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.clamav-defs.aws_s3_bucket.this,
  on .terraform/modules/clamav-defs/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_logging resource instead

(and 8 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.ecr_api"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.ecr_dkr"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.s3"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.sns"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.sts"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_ip_set.ip_allowlist"]
WARN - plan.json - main - Missing Common Tags: ["module.resolver_dns.aws_route53_resolver_firewall_rule_group_association.firewall_rules[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.resolver_dns.aws_route53_resolver_query_log_config.route53_vpc_dns"]

28 tests, 19 passed, 9 warnings, 0 failures, 0 exceptions

```

</details>
